MikroElektronika/core_packages/ARM/gcc_clang/def/nuvoton/NANO130KC2BN/mcu.h
    /**
     * CLKSEL2
     * ===================================================================================================
     * Offset: 0x18  Clock Source Select Control Register 2
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[3:2]   |FRQDIV_S  |Clock Divider Clock Source Selection
     * |        |          |00 = HXT
     * |        |          |01 = LXT
     * |        |          |10 = HCLK
     * |        |          |11 = HIRC
     * |[5:4]   |PWM1_CH01_S|PWM1 Channel 0 And Channel 1 Clock Source Selection
     * |        |          |PWM1 channel 0 and channel 1 use the same Engine clock source, both of them with the same pre-scale
     * |        |          |00 = HXT
     * |        |          |01 = LXT
     * |        |          |10 = HCLK
     * |        |          |11 = HIRC
     * |[7:6]   |PWM1_CH23_S|PWM1 Channel 2 And Channel 2 Clock Source Selection
     * |        |          |PWM1 channel 2 and channel 3 use the same Engine clock source, both of them with the same pre-scale
     * |        |          |00 = HXT
     * |        |          |01 = LXT
     * |        |          |10 = HCLK
     * |        |          |11 = HIRC
     * |[10:8]  |TMR2_S    |Timer2 Clock Source Selection
     * |        |          |000 = HXT
     * |        |          |001 = LXT
     * |        |          |010 = LIRC
     * |        |          |011 = External Pin
     * |        |          |111 = HIRC
     * |        |          |Others = Reserved
     * |[14:12] |TMR3_S    |Timer3 Clock Source Selection
     * |        |          |000 = HXT
     * |        |          |001 = LXT
     * |        |          |010 = LIRC
     * |        |          |011 = External Pin
     * |        |          |111 = HIRC
     * |        |          |Others = Reserved
     * |[17:16] |I2S_S     |I2S Clock Source Selection
     * |        |          |00 = HXT
     * |        |          |01 = PLL Clock
     * |        |          |10 = HIRC
     * |        |          |11 = HIRC
     * |[19:18] |SC_S      |SC Clock Source Selection
     * |        |          |00 = HXT
     * |        |          |01 = PLL Clock
     * |        |          |10 = HIRC
     * |        |          |11 = HIRC
     * |        |          |Note: SC0,SC1 and SC2 use the same Clock Source selection but they have different clock divider number.
     * |[20]    |SPI0_S    |SPI0 Clock Source Selection
     * |        |          |0 = PLL.
     * |        |          |1 = HCLK.
     * |[21]    |SPI1_S    |SPI1 Clock Source Selection
     * |        |          |0 = PLL.
     * |        |          |1 = HCLK.
     * |[22]    |SPI2_S    |SPI2 Clock Source Selection
     * |        |          |0 = PLL.
     * |        |          |1 = HCLK.
    */
    __IO uint32_t CLKSEL2;

    /**
     * CLKDIV0
     * ===================================================================================================
     * Offset: 0x1C  Clock Divider Number Register 0
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[3:0]   |HCLK_N    |HCLK Clock Divide Number From HCLK Clock Source
     * |        |          |The HCLK clock frequency = (HCLK Clock Source frequency) / (HCLK_N + 1).
     * |[7:4]   |USB_N     |USB Clock Divide Number From PLL Clock
     * |        |          |The USB clock frequency = (PLL frequency ) / (USB_N + 1).
     * |[11:8]  |UART_N    |UART Clock Divide Number From UART Clock Source
     * |        |          |The UART clock frequency = (UART Clock Source frequency ) / (UART_N + 1).
     * |[15:12] |I2S_N     |I2S Clock Divide Number From I2S Clock Source
     * |        |          |The I2S clock frequency = (I2S Clock Source frequency ) / (I2S_N + 1).
     * |[23:16] |ADC_N     |ADC Clock Divide Number From ADC Clock Source
     * |        |          |The ADC clock frequency = (ADC Clock Source frequency ) / (ADC_N + 1).
     * |[31:28] |SC0_N     |SC 0 Clock Divide Number From SC 0 Clock Source
     * |        |          |The SC 0 clock frequency = (SC0 Clock Source frequency ) / (SC0_N + 1).
    */
    __IO uint32_t CLKDIV0;

    /**
     * CLKDIV1
     * ===================================================================================================
     * Offset: 0x20  Clock Divider Number Register 1
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[3:0]   |SC1_N     |SC 1 Clock Divide Number From SC 1 Clock Source
     * |        |          |The SC 1 clock frequency = (SC 1 Clock Source frequency ) / (SC1_N + 1).
     * |[7:4]   |SC2_N     |SC 2 Clock Divide Number From SC2 Clock Source
     * |        |          |The SC 2 clock frequency = (SC 2 Clock Source frequency ) / (SC2_N + 1).
    */
    __IO uint32_t CLKDIV1;

    /**
     * PLLCTL
     * ===================================================================================================
     * Offset: 0x24  PLL Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[4:0]   |FB_DV     |PLL Feedback Divider Control Pins
     * |        |          |Refer to the formulas below the table.
     * |        |          |The range of FB_DV is from 0 to 63.
     * |[9:8]   |IN_DV     |PLL Input Divider Control Pins
     * |        |          |Refer to the formulas below the table.
     * |[12]    |OUT_DV    |PLL Output Divider Control Pins
     * |        |          |Refer to the formulas below the table. This bit MUST be 0 for PLL output low deviation.
     * |[16]    |PD        |Power-Down Mode
     * |        |          |If set the PD_EN bit "1" in PWR_CTL register, the PLL will enter Power-down mode too
     * |        |          |0 = PLL is in normal mode.
     * |        |          |1 = PLL is in power-down mode (default).
     * |[17]    |PLL_SRC   |PLL Source Clock Select
     * |        |          |0 = PLL source clock from HXT.
     * |        |          |1 = PLL source clock from HIRC.
    */
    __IO uint32_t PLLCTL;

    /**
     * FRQDIV
     * ===================================================================================================
     * Offset: 0x28  Frequency Divider Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[3:0]   |FSEL      |Divider Output Frequency Selection Bits
     * |        |          |The formula of output frequency is
     * |        |          |Fout = Fin/2^(N+1),.
     * |        |          |Where Fin is the input clock frequency, Fout is the frequency of divider output clock and N is the 4-bit value of FSEL[3:0].
     * |[4]     |FDIV_EN   |Frequency Divider Enable Bit
     * |        |          |0 = Frequency Divider Disabled.
     * |        |          |1 = Frequency Divider Enabled.
    */
    __IO uint32_t FRQDIV;

    /**
     * MCLKO
     * ===================================================================================================
     * Offset: 0x2C  Module Clock Output Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[5:0]   |MCLK_SEL  |Module Clock Output Source Selection (PC.0)
     * |        |          |000000 = ISP_CLK
     * |        |          |000001 = HIRC
     * |        |          |000010 = HXT
     * |        |          |000011 = LXT
     * |        |          |000100 = LIRC
     * |        |          |000101 = PLL output
     * |        |          |000110 = PLL input
     * |        |          |000111 = System Tick
     * |        |          |001000 = HCLK clock
     * |        |          |001010 = PCLK clock
     * |        |          |100000 = TMR0_CLK
     * |        |          |100001 = TMR1_CLK
     * |        |          |100010 = UART0_CLK
     * |        |          |100011 = USB_CLK
     * |        |          |100100 = ADC_CLK
     * |        |          |100101 = WDT_CLK
     * |        |          |100110 = PWM0_CH01_CLK
     * |        |          |100111 = PWM0_CH32_CLK
     * |        |          |101001 = LCD_CLK
     * |        |          |111000 = TMR2_CLK
     * |        |          |111001 = TMR3_CLK
     * |        |          |111010 = UART1_CLK
     * |        |          |111011 = PWM1_CH01_CLK
     * |        |          |111100 = PWM1_CH23_CLK
     * |        |          |111101 = I&sup2;S_CLK
     * |        |          |111110 = SC0_CLK
     * |        |          |111111 = SC1_CLK
     * |[7]     |MCLK_EN   |Module Clock Output Enable
     * |        |          |User can get the module clock output from PC.0 pin via choosing the clock source in the MCLK_SEL bit field and then setting MCLK_EN bit to 1.
     * |        |          |0 = Module clock output Disabled.
     * |        |          |1 = Module clock output Enabled.
     * |        |          |Note: If this bit is enabled, PC.0 will be configured to module clock output and the setting of PC0_MFP will be ineffective
    */
    __IO uint32_t MCLKO;

    /**
     * WK_INTSTS
     * ===================================================================================================
     * Offset: 0x30  Wake-up interrupt status
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |PD_WK_IS  |Wake-Up Interrupt Status In Chip Power-Down Mode
     * |        |          |This bit indicates that some event resumes chip from Power-down mode
     * |        |          |The status is set if external interrupts, UART, GPIO, RTC, USB, SPI, Timer, WDT, and BOD wake-up occurred.
     * |        |          |Write 1 to clear this bit.
    */
    __IO  uint32_t WK_INTSTS;

} CLK_T;

/**
    @addtogroup CLK_CONST CLK Bit Field Definition
    Constant Definitions for CLK Controller
@{ */

