MikroElektronika/core_packages/ARM/gcc_clang/def/nuvoton/NANO130KC2BN/mcu.h
#define UART_ALT_CTL_LIN_HEAD_SEL_Pos    (4)                                               /*!< UART_T::ALT_CTL: LIN_HEAD_SEL Position    */
#define UART_ALT_CTL_LIN_HEAD_SEL_Msk    (0x3ul << UART_ALT_CTL_LIN_HEAD_SEL_Pos)          /*!< UART_T::ALT_CTL: LIN_HEAD_SEL Mask        */

#define UART_ALT_CTL_LIN_RX_EN_Pos       (6)                                               /*!< UART_T::ALT_CTL: LIN_RX_EN Position       */
#define UART_ALT_CTL_LIN_RX_EN_Msk       (0x1ul << UART_ALT_CTL_LIN_RX_EN_Pos)             /*!< UART_T::ALT_CTL: LIN_RX_EN Mask           */

#define UART_ALT_CTL_LIN_TX_EN_Pos       (7)                                               /*!< UART_T::ALT_CTL: LIN_TX_EN Position       */
#define UART_ALT_CTL_LIN_TX_EN_Msk       (0x1ul << UART_ALT_CTL_LIN_TX_EN_Pos)             /*!< UART_T::ALT_CTL: LIN_TX_EN Mask           */

#define UART_ALT_CTL_Bit_ERR_EN_Pos      (8)                                               /*!< UART_T::ALT_CTL: Bit_ERR_EN Position      */
#define UART_ALT_CTL_Bit_ERR_EN_Msk      (0x1ul << UART_ALT_CTL_Bit_ERR_EN_Pos)            /*!< UART_T::ALT_CTL: Bit_ERR_EN Mask          */

#define UART_ALT_CTL_RS485_NMM_Pos      (16)                                              /*!< UART_T::ALT_CTL: RS485_NMM Position      */
#define UART_ALT_CTL_RS485_NMM_Msk      (0x1ul << UART_ALT_CTL_RS485_NMM_Pos)             /*!< UART_T::ALT_CTL: RS485_NMM Mask          */

#define UART_ALT_CTL_RS485_AAD_Pos      (17)                                              /*!< UART_T::ALT_CTL: RS485_AAD Position      */
#define UART_ALT_CTL_RS485_AAD_Msk      (0x1ul << UART_ALT_CTL_RS485_AAD_Pos)             /*!< UART_T::ALT_CTL: RS485_AAD Mask          */

#define UART_ALT_CTL_RS485_AUD_Pos      (18)                                              /*!< UART_T::ALT_CTL: RS485_AUD Position      */
#define UART_ALT_CTL_RS485_AUD_Msk      (0x1ul << UART_ALT_CTL_RS485_AUD_Pos)             /*!< UART_T::ALT_CTL: RS485_AUD Mask          */

#define UART_ALT_CTL_RS485_ADD_EN_Pos   (19)                                              /*!< UART_T::ALT_CTL: RS485_ADD_EN Position   */
#define UART_ALT_CTL_RS485_ADD_EN_Msk   (0x1ul << UART_ALT_CTL_RS485_ADD_EN_Pos)          /*!< UART_T::ALT_CTL: RS485_ADD_EN Mask       */

#define UART_ALT_CTL_ADDR_PID_MATCH_Pos  (24)                                              /*!< UART_T::ALT_CTL: ADDR_PID_MATCH Position  */
#define UART_ALT_CTL_ADDR_PID_MATCH_Msk  (0xfful << UART_ALT_CTL_ADDR_PID_MATCH_Pos)       /*!< UART_T::ALT_CTL: ADDR_PID_MATCH Mask      */

#define UART_FUN_SEL_FUN_SEL_Pos         (0)                                               /*!< UART_T::FUN_SEL: FUN_SEL Position         */
#define UART_FUN_SEL_FUN_SEL_Msk         (0x3ul << UART_FUN_SEL_FUN_SEL_Pos)               /*!< UART_T::FUN_SEL: FUN_SEL Mask             */

/**@}*/ /* UART_CONST */
/**@}*/ /* end of UART register group */


/*---------------------- USB Device Controller -------------------------*/
/**
    @addtogroup USBD USB Device Controller(USBD)
    Memory Mapped Structure for USBD Controller
@{ */

/**
  * @brief USBD endpoints register
  */
typedef struct
{


    /**
     * BUFSEGx
     * ===================================================================================================
     * Offset: 0x20+x*0x10  Endpoint x Buffer Segmentation Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[8:3]   |BUFSEG    |It Is Used To Define The Offset Address For Each Endpoint With The USB SRAM Starting Address Its physical address is USB_SRAM address + {BUFSEG[5:0], 000}; where the USB_SRAM = USB_BASE + 0x100h.
     * |        |          |Refer to the section 5.4.3.3 for the endpoint SRAM structure and its description.
    */
    __IO uint32_t BUFSEG;

    /**
     * MXPLDx
     * ===================================================================================================
     * Offset: 0x24+x*0x10  Endpoint x Maximal Payload Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[8:0]   |MXPLD     |Maximal Payload
     * |        |          |It is used to define the length of data which is transmitted to host (IN token) or the actual length of data receiving from host (OUT token).
     * |        |          |It also used to indicate that the endpoint is ready to be transmitted in IN token or received in OUT token.
     * |        |          |(1). When the register is written by CPU,
     * |        |          |For IN token, the value of MXPLD is used to define the length of data to be transmitted and indicate the data buffer is ready.
     * |        |          |For OUT token, it means that the controller is ready to receive data from host and the value of MXPLD is the maximal data length comes from host.
     * |        |          |(2). When the register is read by CPU,
     * |        |          |For IN token, the value of MXPLD is indicated the length of data be transmitted to host
     * |        |          |For OUT token, the value of MXPLD is indicated the actual length of data receiving from host.
     * |        |          |Note: Once MXPLD is written, the data packets will be transmitted/received immediately after IN/OUT token arrived.
    */
    __IO uint32_t MXPLD;

    /**
     * CFGx
     * ===================================================================================================
     * Offset: 0x28+x*0x10  Endpoint x Configuration Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[3:0]   |EP_NUM    |Endpoint Number
     * |        |          |These bits are used to define the endpoint number of the current endpoint
     * |[4]     |ISOCH     |Isochronous Endpoint
     * |        |          |This bit is used to set the endpoint as Isochronous endpoint, no handshake.
     * |[6:5]   |EPMODE    |Endpoint Mode
     * |        |          |00 = Endpoint is disabled.
     * |        |          |01 = Out endpoint.
     * |        |          |10 = IN endpoint.
     * |        |          |11 = Undefined.
     * |[7]     |DSQ_SYNC  |Data Sequence Synchronization
     * |        |          |0 = DATA0 PID.
     * |        |          |1 = DATA1 PID.
     * |        |          |It is used to specify the DATA0 or DATA1 PID in the current transaction.
     * |        |          |It will toggle automatically in IN token after host response ACK.
     * |        |          |In the other tokens, the user shall take care of it to confirm the right PID in its transaction.
     * |[8]     |CSTALL    |Clear STALL Response
     * |        |          |0 = Disable the device to clear the STALL handshake in setup stage.
     * |        |          |1 = Clear the device to response STALL handshake in setup stage.
     * |[9]     |SSTALL    |Set STALL Response
     * |        |          |0 = Disable the device to response STALL.
     * |        |          |1 = Set the device to respond STALL automatically.
     * |[15]    |CLRRDY    |Clear Ready
     * |        |          |When the USBD_MXPLDx register is set by user, it means that the endpoint is ready to transmit or receive data.
     * |        |          |If the user wants to disable this transaction before the transaction start, users can set this bit to 1 to disable it and it is auto clear to 0.
     * |        |          |For IN token, write '1' to clear the IN token had ready to transmit the data to USB.
     * |        |          |For OUT token, write '1' to clear the OUT token had ready to receive the data from USB.
     * |        |          |This bit is write 1 only and is always 0 when it is read back.
    */
    __IO uint32_t CFG;
    uint32_t RESERVE;

} USBD_EP_T;

typedef struct
{


    /**
     * CTL
     * ===================================================================================================
     * Offset: 0x00  USB Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |USB_EN    |USB Function Enable
     * |        |          |0 = USB Disabled.
     * |        |          |1 = USB Enabled.
     * |[1]     |PHY_EN    |PHY Transceiver Enable
     * |        |          |0 = PHY transceiver Disabled.
     * |        |          |1 = PHY transceiver Enabled.
     * |[2]     |PWRDB     |Power Down PHY Transceiver, Low Active
     * |        |          |0 = Power-down related circuit of PHY transceiver.
     * |        |          |1 = Turn-on related circuit of PHY transceiver.
     * |[3]     |DPPU_EN   |Pull-Up Resistor On USB_DP Enable
     * |        |          |0 = Pull-up resistor in USB_DP bus Disabled.
     * |        |          |1 = Pull-up resistor in USB_DP bus will be active.
     * |[4]     |DRVSE0    |Force USB PHY Transceiver To Drive SE0 (Single Ended Zero)
     * |        |          |The Single Ended Zero is present when both lines (USB_DP, USB_DM) are being pulled low.
     * |        |          |0 = None.
     * |        |          |1 = Force USB PHY transceiver to drive SE0.
     * |        |          |The default value is "1".
     * |[8]     |RWAKEUP   |Remote Wake-Up
     * |        |          |0 = Don't force USB bus to K state.
     * |        |          |1 = Force USB bus to K (USB_DP low, USB_DM: high) state, used for remote wake-up.
     * |[9]     |WAKEUP_EN |Wake-Up Function Enable
     * |        |          |0 = USB wake-up function Disabled.
     * |        |          |1 = USB wake-up function Enabled.
    */
    __IO uint32_t CTL;

    /**
     * BUSSTS
     * ===================================================================================================
     * Offset: 0x04  USB Bus Status Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |USBRST    |USB Reset Status
     * |        |          |1 = Bus reset when SE0 (single-ended 0) more than 2.5uS. It is read only.
     * |[1]     |SUSPEND   |Suspend Status
     * |        |          |1 = Bus idle more than 3 ms, either cable is plugged off or host is sleeping. It is read only.
     * |[2]     |RESUME    |Resume Status
     * |        |          |1 = Resume from suspend. It is read only.
     * |[3]     |TIMEOUT   |Time-Out Flag
     * |        |          |1 = Bus no any response more than 18 bits time. It is read only.
     * |[4]     |FLDET     |Device Floating Detection
     * |        |          |0 = The controller didn't attach into the USB.
     * |        |          |1 = When the controller is attached into the USB, this bit will be set as "1".
    */
    __I  uint32_t BUSSTS;

    /**
     * INTEN
     * ===================================================================================================
     * Offset: 0x08  Interrupt Enable Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |BUSEVT_IE |Bus Event Interrupt Enable
     * |        |          |0 = BUS event interrupt Disabled.
     * |        |          |1 = BUS event interrupt Enabled.
     * |[1]     |USBEVT_IE |USB Event Interrupt Enable
     * |        |          |0 = USB event interrupt Disabled.
     * |        |          |1 = USB event interrupt Enabled.
     * |[2]     |FLDET_IE  |Floating Detect Interrupt Enable
     * |        |          |0 = Floating detect Interrupt Disabled.
     * |        |          |1 = Floating detect Interrupt Enabled.
     * |[3]     |WAKEUP_IE |USB Wake-Up Interrupt Enable
     * |        |          |0 = Wake-up Interrupt Disabled.
     * |        |          |1 = Wake-up Interrupt Enabled.
    */
    __IO uint32_t INTEN;

    /**
     * INTSTS
     * ===================================================================================================
     * Offset: 0x0C  Interrupt Event Status Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |BUS_STS   |BUS Interrupt Status
     * |        |          |The BUS event means there is bus suspense or bus resume in the bus.
     * |        |          |This bit is used to indicate that there is one of events in the bus.
     * |        |          |0 = No BUS event is occurred.
     * |        |          |1 = BUS event occurred; check USB_BUSSTS [3:0] to know which kind of bus event was occurred, cleared by write "1" to USB_INTSTS [0].
     * |[1]     |USB_STS   |USB Interrupt Status
     * |        |          |The USB event means that there is Setup Token, IN token, OUT ACK, ISO IN, or ISO OUT event in the bus.
     * |        |          |This bit is used to indicate that there is one of events in the bus.
     * |        |          |0 = No USB event is occurred.
     * |        |          |1 = USB event occurred, check EPSTS0~7[3:0] in USB_EPSTS [31:8] to know which kind of USB event was occurred, cleared by write "1" to USB_INTSTS [1] or USB_INTSTS[31] or EPEVT0~7.
     * |[2]     |FLD_STS   |Floating Interrupt Status
     * |        |          |0 = There is not attached event in the USB.
     * |        |          |1 = There is attached event in the USB and it is cleared by write "1" to USB_INTSTS [2].
     * |[3]     |WKEUP_STS |Wake-Up Interrupt Status
     * |        |          |0 = No wake-up event is occurred.
     * |        |          |1 = Wake-up event occurred, cleared by write 1 to USB_INTSTS [3].
     * |[16]    |EPEVT0    |USB Event Status On EP0
     * |        |          |0 = No event occurred in Endpoint 0.
     * |        |          |1 = USB event occurred on Endpoint 0, check USB_EPSTS[11:8] to know which kind of USB event was occurred, cleared by write "1" to USB_INTSTS [16] or USB_INTSTS [1].
     * |[17]    |EPEVT1    |USB Event Status On EP1
     * |        |          |0 = No event occurred in Endpoint 1.
     * |        |          |1 = USB event occurred on Endpoint 1, check USB_EPSTS[15:12] to know which kind of USB event was occurred, cleared by write "1" to USB_INTSTS [17] or USB_INTSTS [1].
     * |[18]    |EPEVT2    |USB Event Status On EP2
     * |        |          |0 = No event occurred in Endpoint 2.
     * |        |          |1 = USB event occurred on Endpoint 2, check USB_EPSTS[19:16] to know which kind of USB event was occurred, cleared by write "1" to USB_INTSTS [18] or USB_INTSTS [1].
     * |[19]    |EPEVT3    |USB Event Status On EP3
     * |        |          |0 = No event occurred in Endpoint 3.
     * |        |          |1 = USB event occurred on Endpoint 3, check USB_EPSTS[23:20] to know which kind of USB event was occurred, cleared by write "1" to USB_INTSTS [19] or USB_INTSTS [1].
     * |[20]    |EPEVT4    |USB Event Status On EP4
     * |        |          |0 = No event occurred in Endpoint 4.
     * |        |          |1 = USB event occurred on Endpoint 4, check USB_EPSTS[27:24] to know which kind of USB event was occurred, cleared by write "1" to USB_INTSTS [20] or USB_INTSTS [1].
     * |[21]    |EPEVT5    |USB Event Status On EP5
     * |        |          |0 = No event occurred in Endpoint 5.
     * |        |          |1 = USB event occurred on Endpoint 5, check USB_EPSTS[31:28] to know which kind of USB event was occurred, cleared by write "1" to USB_INTSTS [21] or USB_INTSTS [1].
     * |[22]    |EPEVT6    |USB Event Status On EP6
     * |        |          |0 = No event occurred in Endpoint 6.
     * |        |          |1 = USB event occurred on Endpoint 6, check USB_EPSTS2[2:0] to know which kind of USB event was occurred, cleared by write "1" to USB_INTSTS [22] or USB_INTSTS [1].
     * |[23]    |EPEVT7    |USB Event Status On EP7
     * |        |          |0 = No event occurred in Endpoint 7.
     * |        |          |1 = USB event occurred on Endpoint 7, check USB_EPSTS2[6:4] to know which kind of USB event was occurred, cleared by write "1" to USB_INTSTS [23] or USB_INTSTS [1].
     * |[31]    |SETUP     |Setup Event Status
     * |        |          |0 = No Setup event.
     * |        |          |1 = Setup event occurred, cleared by write "1" to USB_INTSTS[31].
    */
    __IO uint32_t INTSTS;

    /**
     * FADDR
     * ===================================================================================================
     * Offset: 0x10  Device 's Function Address Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[6:0]   |FADDR     |USB device's function address
    */
    __IO uint32_t FADDR;

    /**
     * EPSTS
     * ===================================================================================================
     * Offset: 0x14  Endpoint Status Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[7]     |OVERRUN   |Overrun
     * |        |          |It means the received data is over the maximum payload number or not.
     * |        |          |0 = No overrun.
     * |        |          |1 = Out Data more than the Max Payload in MXPLD register or the Setup Data more than 8 Bytes.
     * |[11:8]  |EPSTS0    |Endpoint 0 Bus Status
     * |        |          |These bits are used to show the current status of this endpoint.
     * |        |          |Definition is the same with EPSTS5(USB_EPSTS[27:24]).
     * |[15:12] |EPSTS1    |Endpoint 1 Bus Status
     * |        |          |These bits are used to show the current status of this endpoint.
     * |        |          |Definition is the same with EPSTS5(USB_EPSTS[27:24]).
     * |[19:16] |EPSTS2    |Endpoint 2 Bus Status
     * |        |          |These bits are used to show the current status of this endpoint.
     * |        |          |Definition is the same with EPSTS5(USB_EPSTS[27:24]).
     * |[23:20] |EPSTS3    |Endpoint 3 Bus Status
     * |        |          |These bits are used to show the current status of this endpoint.
     * |        |          |Definition is the same with EPSTS5(USB_EPSTS[27:24]).
     * |[27:24] |EPSTS4    |Endpoint 4 Bus Status
     * |        |          |These bits are used to show the current status of this endpoint.
     * |        |          |Definition is the same with EPSTS5(USB_EPSTS[27:24]).
     * |[31:28] |EPSTS5    |Endpoint 5 Bus Status
     * |        |          |These bits are used to show the current status of this endpoint.
     * |        |          |0000 = INACK.
     * |        |          |0001 = IN NAK (INTERNAL ONLY).
     * |        |          |0010 = OUT Packet Data0 ACK.
     * |        |          |0011 = Setup ACK
     * |        |          |0110 = OUT Packet Data1 ACK.
     * |        |          |0111 = Isochronous transfer end.
    */
    __I  uint32_t EPSTS;

    /**
     * BUFSEG
     * ===================================================================================================
     * Offset: 0x18  Setup Token Buffer Segmentation Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[8:3]   |BUFSEG    |This Register Is Used For Setup Token Only
     * |        |          |It is used to define the offset address for the Setup Token with the USB SRAM starting address.
     * |        |          |Its physical address is USB_SRAM address + {BUFSEG[5:0], 000} where the USB_SRAM = USB_BASE + 0x100h.
    */
    __IO uint32_t BUFSEG;

    /**
     * EPSTS2
     * ===================================================================================================
     * Offset: 0x1C  Endpoint Bus Status
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[2:0]   |EPSTS6    |Endpoint 6 Bus Status
     * |        |          |These bits are used to show the current status of this endpoint.
     * |        |          |Definition is the same with EPSTS5(USB_EPSTS[27:24]).
     * |[6:4]   |EPSTS7    |Endpoint 7 Bus Status
     * |        |          |These bits are used to show the current status of this endpoint.
     * |        |          |Definition is the same with EPSTS5(USB_EPSTS[27:24]).
    */
    __I  uint32_t EPSTS2;


